# Pandas Intro

In [38]:
import pandas as pd
import numpy as np

In [39]:
median_income_dict = {
    "Alexandria": 80847,
    "Amherst": 44757,
    "Arlington": 94880,
    "Augusta": 50612,
    "Bedford": 54110,
    "Botetourt": 64724,
    "Fairfax": 105416,
    "Falls Church": 114409,
    "Prince William": 91098,
}

median_income_dict

{'Alexandria': 80847,
 'Amherst': 44757,
 'Arlington': 94880,
 'Augusta': 50612,
 'Bedford': 54110,
 'Botetourt': 64724,
 'Fairfax': 105416,
 'Falls Church': 114409,
 'Prince William': 91098}

In [40]:
median_income_dict["Bedford"] # dictionary key as like an index

54110

In [41]:
median_income_series = pd.Series(median_income_dict, dtype=np.int32)

In [42]:
median_income_series

Alexandria         80847
Amherst            44757
Arlington          94880
Augusta            50612
Bedford            54110
Botetourt          64724
Fairfax           105416
Falls Church      114409
Prince William     91098
dtype: int32

In [43]:
median_income_series.head()

Alexandria    80847
Amherst       44757
Arlington     94880
Augusta       50612
Bedford       54110
dtype: int32

In [44]:
median_income_series.head(3)

Alexandria    80847
Amherst       44757
Arlington     94880
dtype: int32

In [45]:
median_income_series.tail()

Bedford            54110
Botetourt          64724
Fairfax           105416
Falls Church      114409
Prince William     91098
dtype: int32

In [46]:
median_income_series.tail(3)

Fairfax           105416
Falls Church      114409
Prince William     91098
dtype: int32

In [47]:
median_income_series.index

Index(['Alexandria', 'Amherst', 'Arlington', 'Augusta', 'Bedford', 'Botetourt',
       'Fairfax', 'Falls Church', 'Prince William'],
      dtype='object')

In [48]:
median_income_series.values

array([ 80847,  44757,  94880,  50612,  54110,  64724, 105416, 114409,
        91098])

In [49]:
type(median_income_series.values)

numpy.ndarray

In [50]:
median_income_series["Amherst"]

44757

In [51]:
median_income_series[ ["Amherst", "Augusta"] ]

Amherst    44757
Augusta    50612
dtype: int32

In [53]:
median_income_series["Amherst":"Bedford"]

Amherst      44757
Arlington    94880
Augusta      50612
Bedford      54110
dtype: int32

In [54]:
median_income_series.loc[ ["Amherst", "Augusta"] ]

Amherst    44757
Augusta    50612
dtype: int32

In [55]:
median_income_series[1]

44757

In [56]:
median_income_series[ [1,2] ]

Amherst      44757
Arlington    94880
dtype: int32

In [57]:
median_income_series[1:3]

Amherst      44757
Arlington    94880
dtype: int32

In [59]:
median_income_series.iloc[ [2,5]]

Arlington    94880
Botetourt    64724
dtype: int32

In [60]:
median_income_series.shape

(9,)

In [62]:
households_dict = {
    "Alexandria": 68082,
    "Amherst": 12560,
    "Arlington": 98050,
    "Augusta": 28516,
    "Bedford": 27465,
    "Botetourt": 13126,
    "Fairfax": 391627,
    "Falls Church":	5101,
    "Prince William": 130785,
}

households_series = pd.Series(households_dict)

households_series

Alexandria         68082
Amherst            12560
Arlington          98050
Augusta            28516
Bedford            27465
Botetourt          13126
Fairfax           391627
Falls Church        5101
Prince William    130785
dtype: int64

In [66]:
counties = pd.DataFrame({
    "median_income": median_income_series,
    "households": households_series
})

counties

                median_income  households
Alexandria              80847       68082
Amherst                 44757       12560
Arlington               94880       98050
Augusta                 50612       28516
Bedford                 54110       27465
Botetourt               64724       13126
Fairfax                105416      391627
Falls Church           114409        5101
Prince William          91098      130785

In [67]:
counties.columns

Index(['median_income', 'households'], dtype='object')

In [68]:
counties.index

Index(['Alexandria', 'Amherst', 'Arlington', 'Augusta', 'Bedford', 'Botetourt',
       'Fairfax', 'Falls Church', 'Prince William'],
      dtype='object')

In [69]:
counties.values

array([[ 80847,  68082],
       [ 44757,  12560],
       [ 94880,  98050],
       [ 50612,  28516],
       [ 54110,  27465],
       [ 64724,  13126],
       [105416, 391627],
       [114409,   5101],
       [ 91098, 130785]], dtype=int64)

In [70]:
type(counties.values)

numpy.ndarray

In [71]:
counties.columns = [ "Median Income", "Households" ]

In [72]:
counties

                Median Income  Households
Alexandria              80847       68082
Amherst                 44757       12560
Arlington               94880       98050
Augusta                 50612       28516
Bedford                 54110       27465
Botetourt               64724       13126
Fairfax                105416      391627
Falls Church           114409        5101
Prince William          91098      130785

In [73]:
counties2 = counties.stack()

counties2

Alexandria      Median Income     80847
                Households        68082
Amherst         Median Income     44757
                Households        12560
Arlington       Median Income     94880
                Households        98050
Augusta         Median Income     50612
                Households        28516
Bedford         Median Income     54110
                Households        27465
Botetourt       Median Income     64724
                Households        13126
Fairfax         Median Income    105416
                Households       391627
Falls Church    Median Income    114409
                Households         5101
Prince William  Median Income     91098
                Households       130785
dtype: int64

In [74]:
type(counties2)

pandas.core.series.Series

In [75]:
counties2.index

MultiIndex([(    'Alexandria', 'Median Income'),
            (    'Alexandria',    'Households'),
            (       'Amherst', 'Median Income'),
            (       'Amherst',    'Households'),
            (     'Arlington', 'Median Income'),
            (     'Arlington',    'Households'),
            (       'Augusta', 'Median Income'),
            (       'Augusta',    'Households'),
            (       'Bedford', 'Median Income'),
            (       'Bedford',    'Households'),
            (     'Botetourt', 'Median Income'),
            (     'Botetourt',    'Households'),
            (       'Fairfax', 'Median Income'),
            (       'Fairfax',    'Households'),
            (  'Falls Church', 'Median Income'),
            (  'Falls Church',    'Households'),
            ('Prince William', 'Median Income'),
            ('Prince William',    'Households')],
           )

In [76]:
counties2.values

array([ 80847,  68082,  44757,  12560,  94880,  98050,  50612,  28516,
        54110,  27465,  64724,  13126, 105416, 391627, 114409,   5101,
        91098, 130785], dtype=int64)

In [87]:
counties2 = counties.stack()

counties2

Alexandria      Median Income     80847
                Households        68082
Amherst         Median Income     44757
                Households        12560
Arlington       Median Income     94880
                Households        98050
Augusta         Median Income     50612
                Households        28516
Bedford         Median Income     54110
                Households        27465
Botetourt       Median Income     64724
                Households        13126
Fairfax         Median Income    105416
                Households       391627
Falls Church    Median Income    114409
                Households         5101
Prince William  Median Income     91098
                Households       130785
dtype: int64

In [88]:
counties2 = counties2.unstack(0)

counties2

,Alexandria,Amherst,Arlington,Augusta,Bedford,Botetourt,Fairfax,Falls Church,Prince William
Median Income,80847,44757,94880,50612,54110,64724,105416,114409,91098
Households,68082,12560,98050,28516,27465,13126,391627,5101,130785

In [92]:
counties2.unstack()

Alexandria      Median Income     80847
                Households        68082
Amherst         Median Income     44757
                Households        12560
Arlington       Median Income     94880
                Households        98050
Augusta         Median Income     50612
                Households        28516
Bedford         Median Income     54110
                Households        27465
Botetourt       Median Income     64724
                Households        13126
Fairfax         Median Income    105416
                Households       391627
Falls Church    Median Income    114409
                Households         5101
Prince William  Median Income     91098
                Households       130785
dtype: int64

In [91]:
counties

                Median Income  Households
Alexandria              80847       68082
Amherst                 44757       12560
Arlington               94880       98050
Augusta                 50612       28516
Bedford                 54110       27465
Botetourt               64724       13126
Fairfax                105416      391627
Falls Church           114409        5101
Prince William          91098      130785

In [93]:
median_income_series

Alexandria         80847
Amherst            44757
Arlington          94880
Augusta            50612
Bedford            54110
Botetourt          64724
Fairfax           105416
Falls Church      114409
Prince William     91098
dtype: int32

In [94]:
median_income_series["Amherst"]

44757

In [96]:
counties["Median Income"]

Alexandria         80847
Amherst            44757
Arlington          94880
Augusta            50612
Bedford            54110
Botetourt          64724
Fairfax           105416
Falls Church      114409
Prince William     91098
Name: Median Income, dtype: int32

In [97]:
type(counties["Median Income"])

pandas.core.series.Series

In [98]:
counties.loc [ ["Amherst", "Augusta"] ]

         Median Income  Households
Amherst          44757       12560
Augusta          50612       28516

In [99]:
counties["Amherst":"Bedford"]

           Median Income  Households
Amherst            44757       12560
Arlington          94880       98050
Augusta            50612       28516
Bedford            54110       27465

In [100]:
counties["Region"] = [
    "Northern",
    "Central",
    "Northern",
    "Central",
    "Central",
    "Southwestern",
    "Northern",
    "Northern",
    "Northern",
]

counties

                Median Income  Households        Region
Alexandria              80847       68082      Northern
Amherst                 44757       12560       Central
Arlington               94880       98050      Northern
Augusta                 50612       28516       Central
Bedford                 54110       27465       Central
Botetourt               64724       13126  Southwestern
Fairfax                105416      391627      Northern
Falls Church           114409        5101      Northern
Prince William          91098      130785      Northern

In [101]:
counties["Total Household Income"] = counties["Median Income"] * counties["Households"]

In [102]:
counties

,Median Income,Households,Region,Total Household Income
Alexandria,80847,68082,Northern,5504225454
Amherst,44757,12560,Central,562147920
Arlington,94880,98050,Northern,9302984000
Augusta,50612,28516,Central,1443251792
Bedford,54110,27465,Central,1486131150
Botetourt,64724,13126,Southwestern,849567224
Fairfax,105416,391627,Northern,41283751832
Falls Church,114409,5101,Northern,583600309
Prince William,91098,130785,Northern,11914251930

In [103]:
counties.index.name = "County"

counties

,Median Income,Households,Region,Total Household Income
County,,,,
Alexandria,80847,68082,Northern,5504225454
Amherst,44757,12560,Central,562147920
Arlington,94880,98050,Northern,9302984000
Augusta,50612,28516,Central,1443251792
Bedford,54110,27465,Central,1486131150
Botetourt,64724,13126,Southwestern,849567224
Fairfax,105416,391627,Northern,41283751832
Falls Church,114409,5101,Northern,583600309
Prince William,91098,130785,Northern,11914251930

In [104]:
counties.to_csv("counties.csv")

In [105]:
counties3 = pd.read_csv("counties.csv", index_col=0)

counties3

,Median Income,Households,Region,Total Household Income
County,,,,
Alexandria,80847,68082,Northern,5504225454
Amherst,44757,12560,Central,562147920
Arlington,94880,98050,Northern,9302984000
Augusta,50612,28516,Central,1443251792
Bedford,54110,27465,Central,1486131150
Botetourt,64724,13126,Southwestern,849567224
Fairfax,105416,391627,Northern,41283751832
Falls Church,114409,5101,Northern,583600309
Prince William,91098,130785,Northern,11914251930

In [106]:
import sys

# !conda install --yes --prefix {sys.prefix} openpyxl
!pip install openpyxl

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Users\ericwgreene\anaconda3\envs\jupyter_conda_am

  added / updated specs:
    - openpyxl


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    et_xmlfile-1.1.0           |   py39haa95532_0          10 KB
    ------------------------------------------------------------
                                           Total:          10 KB

The following NEW packages will be INSTALLED:

  et_xmlfile         pkgs/main/win-64::et_xmlfile-1.1.0-py39haa95532_0
  jdcal              pkgs/main/noarch::jdcal-1.4.1-py_0
  openpyxl           pkgs/main/noarch::openpyxl-3.0.7-pyhd3eb1b0_0



Downloading and Extracting Packages

et_xmlfile-1.1.0     | 10 KB     |            |   0%
et_xmlfile-1.1.0     | 10 KB     | ########## | 100%
et_xmlfile-1.1.0     | 10 KB     | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

In [109]:
import pathlib

wine_data_file_name = pathlib.Path("exercises", "data", "Portuguese_VinhoVerde_RedWine_Quality.xlsx")

wine_data = pd.read_excel(wine_data_file_name, "data")

wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,11.6,0.580,0.66,2.20,0.074,10.0,47.0,1.00080,3.25,0.57,9.0,3
1,10.4,0.610,0.49,2.10,0.200,5.0,16.0,0.99940,3.16,0.63,8.4,3
2,7.4,1.185,0.00,4.25,0.097,5.0,14.0,0.99660,3.63,0.54,10.7,3
3,10.4,0.440,0.42,1.50,0.145,34.0,48.0,0.99832,3.38,0.86,9.9,3
4,8.3,1.020,0.02,3.40,0.084,6.0,11.0,0.99892,3.48,0.49,11.0,3

In [110]:
wine_data.dtypes

fixed acidity           float64
volatile acidity        float64
citric acid             float64
residual sugar          float64
chlorides               float64
free sulfur dioxide     float64
total sulfur dioxide    float64
density                 float64
pH                      float64
sulphates               float64
alcohol                 float64
quality                   int64
dtype: object

In [111]:
wine_dtypes = {
    "fixed acidity": np.float32,
    "volatile acidity": np.float32,
    "citric acid": np.float32,
    "residual sugar": np.float32,
    "chlorides": np.float32,
    "free sulfur dioxide": np.int8,
    "total sulfur dioxide": np.int8,
    "density": np.float32,
    "pH": np.float32,
    "sulphates": np.float32,
    "alcohol": np.float32,
    "quality": np.int8,
}


wine_data = pd.read_excel(wine_data_file_name, "data", dtype=wine_dtypes)

wine_data

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,11.6,0.580,0.66,2.20,0.074,10,47,1.00080,3.25,0.57,9.0,3
1,10.4,0.610,0.49,2.10,0.200,5,16,0.99940,3.16,0.63,8.4,3
2,7.4,1.185,0.00,4.25,0.097,5,14,0.99660,3.63,0.54,10.7,3
3,10.4,0.440,0.42,1.50,0.145,34,48,0.99832,3.38,0.86,9.9,3
4,8.3,1.020,0.02,3.40,0.084,6,11,0.99892,3.48,0.49,11.0,3
...,...,...,...,...,...,...,...,...,...,...,...,...
1594,8.6,0.420,0.39,1.80,0.068,6,12,0.99516,3.35,0.69,11.7,8
1595,5.5,0.490,0.03,1.80,0.044,28,87,0.99080,3.50,0.82,14.0,8
1596,7.2,0.330,0.33,1.70,0.061,3,13,0.99600,3.23,1.10,10.0,8
1597,7.2,0.380,0.31,2.00,0.056,15,29,0.99472,3.23,0.76,11.3,8
1598,7.4,0.360,0.30,1.80,0.074,17,24,0.99419,3.24,0.70,11.4,8

In [112]:
wine_data.dtypes

fixed acidity           float32
volatile acidity        float32
citric acid             float32
residual sugar          float32
chlorides               float32
free sulfur dioxide        int8
total sulfur dioxide       int8
density                 float32
pH                      float32
sulphates               float32
alcohol                 float32
quality                    int8
dtype: object

In [113]:
wine_data.index

RangeIndex(start=0, stop=1599, step=1)

In [114]:
wine_data.columns

Index(['fixed acidity', 'volatile acidity', 'citric acid', 'residual sugar',
       'chlorides', 'free sulfur dioxide', 'total sulfur dioxide', 'density',
       'pH', 'sulphates', 'alcohol', 'quality'],
      dtype='object')

In [115]:
wine_data.values

array([[11.6  ,  0.58 ,  0.66 , ...,  0.57 ,  9.   ,  3.   ],
       [10.4  ,  0.61 ,  0.49 , ...,  0.63 ,  8.4  ,  3.   ],
       [ 7.4  ,  1.185,  0.   , ...,  0.54 , 10.7  ,  3.   ],
       ...,
       [ 7.2  ,  0.33 ,  0.33 , ...,  1.1  , 10.   ,  8.   ],
       [ 7.2  ,  0.38 ,  0.31 , ...,  0.76 , 11.3  ,  8.   ],
       [ 7.4  ,  0.36 ,  0.3  , ...,  0.7  , 11.4  ,  8.   ]],
      dtype=float32)

In [116]:
wine_data["quality"]

0       3
1       3
2       3
3       3
4       3
       ..
1594    8
1595    8
1596    8
1597    8
1598    8
Name: quality, Length: 1599, dtype: int8

In [121]:
df1 = pd.DataFrame({'A': [0, 0], 'B': [4, 4]})

df2 = pd.DataFrame({'C': [1, 2, 4], 'D': [3, 3, 8]})

display(df1)
display(df2)

   A  B
0  0  4
1  0  4

   C  D
0  1  3
1  2  3
2  4  8

In [123]:
df1.join?

Signature: df1.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False) -> 'DataFrame'
Docstring:
Join columns of another DataFrame.

Join columns with `other` DataFrame either on index or on a key
column. Efficiently join multiple DataFrame objects by index at once by
passing a list.

Parameters
----------
other : DataFrame, Series, or list of DataFrame
    Index should be similar to one of the columns in this one. If a
    Series is passed, its name attribute must be set, and that will be
    used as the column name in the resulting joined DataFrame.
on : str, list of str, or array-like, optional
    Column or index level name(s) in the caller to join on the index
    in `other`, otherwise joins index-on-index. If multiple
    values given, the `other` DataFrame must have a MultiIndex. Can
    pass an array as the join key if it is not already contained in
    the calling DataFrame. Like an Excel VLOOKUP operation.
how : {'left', 'right', 'outer', 'inner'}, default 'left'
    How to handle the operation of the two objects.

    * left: use calling frame's index (or column if on is specified)
    * right: use `other`'s index.
    * outer: form union of calling frame's index (or column if on is
      specified) with `other`'s index, and sort it.
      lexicographically.
    * inner: form intersection of calling frame's index (or column if
      on is specified) with `other`'s index, preserving the order
      of the calling's one.
lsuffix : str, default ''
    Suffix to use from left frame's overlapping columns.
rsuffix : str, default ''
    Suffix to use from right frame's overlapping columns.
sort : bool, default False
    Order result DataFrame lexicographically by the join key. If False,
    the order of the join key depends on the join type (how keyword).

Returns
-------
DataFrame
    A dataframe containing columns from both the caller and `other`.

See Also
--------
DataFrame.merge : For column(s)-on-column(s) operations.

Notes
-----
Parameters `on`, `lsuffix`, and `rsuffix` are not supported when
passing a list of `DataFrame` objects.

Support for specifying index levels as the `on` parameter was added
in version 0.23.0.

Examples
--------
>>> df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
...                    'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

>>> df
  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

>>> other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
...                       'B': ['B0', 'B1', 'B2']})

>>> other
  key   B
0  K0  B0
1  K1  B1
2  K2  B2

Join DataFrames using their indexes.

>>> df.join(other, lsuffix='_caller', rsuffix='_other')
  key_caller   A key_other    B
0         K0  A0        K0   B0
1         K1  A1        K1   B1
2         K2  A2        K2   B2
3         K3  A3       NaN  NaN
4         K4  A4       NaN  NaN
5         K5  A5       NaN  NaN

If we want to join using the key columns, we need to set key to be
the index in both `df` and `other`. The joined DataFrame will have
key as its index.

>>> df.set_index('key').join(other.set_index('key'))
      A    B
key
K0   A0   B0
K1   A1   B1
K2   A2   B2
K3   A3  NaN
K4   A4  NaN
K5   A5  NaN

Another option to join using the key columns is to use the `on`
parameter. DataFrame.join always uses `other`'s index but we can use
any column in `df`. This method preserves the original DataFrame's
index in the result.

>>> df.join(other.set_index('key'), on='key')
  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K2  A2   B2
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN
File:      c:\users\ericwgreene\anaconda3\envs\jupyter_conda_am\lib\site-packages\pandas\core\frame.py
Type:      method

In [124]:
df3 = df1.join(df2, how="right")

df3

     A    B  C  D
0  0.0  4.0  1  3
1  0.0  4.0  2  3
2  NaN  NaN  4  8

In [125]:
df1 = pd.DataFrame({'A': [0, 0], 'B': [4, 4]})
df2 = pd.DataFrame({'A': [1, 1], 'B': [3, 3]})

display(df1)
display(df2)

   A  B
0  0  4
1  0  4

   A  B
0  1  3
1  1  3

In [129]:
df3 = pd.concat([ df1, df2 ])

df3.reset_index(drop=True, inplace=True)

df3

   A  B
0  0  4
1  0  4
2  1  3
3  1  3